<?php

namespace DataBase\seeders;

use Doctrine\Common\DataFixtures\FixtureInterface;
use Doctrine\Persistence\ObjectManager;
use PHPMVC\entities\Specialization;

class SpecializationSeeder implements FixtureInterface
{

    public function load(ObjectManager $manager)
    {
        $specializations = [
            "بنية تحتية" => [
                "تتعلق بالبلاغات التي تتعلق بالمشكلات في البنية التحتية داخل الحرم الجامعي، مثل مشاكل الصرف الصحي، أو الطرق المتضررة، أو مشاكل في نظام التكييف أو التدفئة."
                ,"infra.png"
            ],
            "تقنية" => [
                "تشمل البلاغات المتعلقة بالمشاكل التقنية داخل الحرم الجامعي، مثل انقطاع الكهرباء، أو مشكلات في الشبكة اللاسلكية، أو أجهزة الكمبيوتر المعطلة. وتشمل أيضًا بلاغات الاختراق الإلكتروني وسرقة المعلومات."
                ,"electronic.png"
            ],

            "صحية" => [
                "تتعلق بالبلاغات التي تتعلق بالقضايا الصحية داخل الحرم الجامعي، مثل حالات الطوارئ الصحية، أو حالات الإصابة بالأمراض المعدية، أو الحملات الصحية الوقائية."
                ,"cleanliness.png"
            ],
            "صيانة" => [
                "شمل البلاغات المتعلقة بالصيانة والإصلاحات اللازمة داخل الحرم الجامعي، مثل الأعطال في الأجهزة والمعدات، أو الأعمال الكهربائية والسباكة، أو الصيانة العامة للمباني."
                ,"monitoring.png"
            ],
            "حيوانات ضارة" => [
                "تشمل البلاغات التي تتعلق بوجود الحيوانات الضارة داخل الحرم الجامعي، مثل الحشرات أو القوارض التي تسبب إزعاجًا أو تهديدًا للسلامة العامة."
                ,"animal-cruelty.png"
            ],
            "مفقودات شخصية" => [
                "تتعلق بالبلاغات التي تتعلق بفقدان الممتلكات الشخصية داخل الحرم الجامعي، مثل الهواتف المحمولة، أو المحافظ، أو المفاتيح."
                ,"lost-and-found.png"
            ],
            "سلامة شخصية" => [
                "تشمل البلاغات التي تتعلق بالمخاطر والحوادث التي تؤثر على سلامة الأفراد داخل الحرم الجامعي، مثل السلالم المتضررة، أو وجود مواد كيميائية خطرة بطريقة غير صحيحة، أو الوصول الغير قانوني إلى المناطق المحظورة."
                ,"safe.png"
            ],
            "ازدحام وتنظيم" => [
                "تشمل البلاغات التي تتعلق بالازدحام الزائد داخل الحرم الجامعي ومشاكل التنظيم، مثل تداخل جداول الفصول الدراسية، أو نقص المقاعد في المكتبات، أو ازدحام المواقف للسيارات."
                ,"organize.png"
            ],
            "تلوث بيئي" => [
                "تتعلق بالبلاغات التي تتعلق بالتلوث البيئي داخل الحرم الجامعي، مثل التسربات النفطية، أو التخلص غير الآمن من المخلفات الكيميائية."
                ,"infection.png"
            ],
        ];

        foreach ($specializations as $specName => $details ) {
            $spec = new Specialization();
            $spec->setSpecialization($specName);
            $spec->setInformation($details[0]);
            $spec->setImg($details[1]);
            $manager->persist($spec);
        }
        $manager->flush();
    }
}